ch570512/Qlockwork/src/main.cpp
//=============================================================================
// QLOCKWORK
// @created 12.03.2017
// @mc ESP8266
//
// This source file is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published
// by the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// This source file is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with this program.  If not, see <http://www.gnu.org/licenses/>.
//=============================================================================

#if !defined(ESP8266)
#error This code is designed to run on ESP8266-based boards! Please check your Tools->Board setting.
#endif

#define FIRMWARE_VERSION 20260529

#include <Arduino.h>
#include <ArduinoOTA.h>
#include <DHT.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <WiFiManager.h>
#include <IRremoteESP8266.h>
#include <IRutils.h>
#include <time.h>
#include <sys/time.h>
#include "Colors.h"
#include "Configuration.h"
#include "Debug.h"
#include "Events.h"
#include "LedDriver.h"
#include "MeteoWeather.h"
#include "Modes.h"
#include "Renderer.h"
#include "Settings.h"
#include "WebServer.h"

void buttonModeInterrupt();
void buttonModePressed();
void buttonOnOffInterrupt();
void buttonOnOffPressed();
void buttonTimeInterrupt();
void buttonTimePressed();
void callRoot();
uint8_t getBrightnessFromLDR();
void getRoomConditions();
void handleButtonSettings();
void handleCommitSettings();
void handleControl();
void handleRoot();
void handleSetEvent();
void handleShowText();
void moveScreenBufferUp(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness);
String padStringZeros(String input);
void setLedsOff();
void setLedsOn();
void setMode(Mode newMode);
void setupWebServer();
void writeScreenBuffer(uint16_t screenBuffer[], uint8_t color, uint8_t brightness);
void writeScreenBufferFade(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness);

//=============================================================================
// Init
//=============================================================================

// HTTP-Server
#ifdef WEBSERVER
ESP8266WebServer webServer(80);
#endif

// DHT22
#ifdef SENSOR_DHT22
DHT dht(PIN_DHT22, DHT22);
#endif

// IR receiver
#ifdef IR_RECEIVER
IRrecv irrecv(PIN_IR_RECEIVER);
decode_results irDecodeResult;
#endif

// LED driver
LedDriver ledDriver;

// Renderer
Renderer renderer;

// Settings
Settings settings;

// Screenbuffer
uint16_t matrix[10] = {};
uint16_t matrixOld[10] = {};
bool screenBufferNeedsUpdate = true;

// Mode
Mode mode = MODE_TIME;
Mode lastMode = mode;
uint32_t modeTimeout = 0;
uint32_t autoModeChangeTimer = AUTO_MODECHANGE_TIME;
bool runTransitionOnce = false;
uint8_t autoMode = 0;

// Time
uint8_t lastDay = 0;
uint8_t lastMinute = 0;
uint8_t lastHour = 0;
uint8_t lastSecond = 0;
uint8_t randomHour = 0;
uint8_t randomMinute = 0;
uint8_t moonphase = 0;
time_t upTime = 0;
const String dayOfWeek[] = {
    "Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
const String monthOfYear[] = {
    "January", "February", "March", "April", "May", "June",
    "July", "August", "September", "October", "November", "December"};

// Feed
String feedText = "";
uint8_t feedColor = WHITE;
uint8_t feedPosition = 0;

// MeteoWeather
#ifdef WEATHER
MeteoWeather outdoorWeather;
uint8_t errorCounterOutdoorWeather = 0;
#endif

// DHT22
float roomTemperature = 0;
float roomHumidity = 0;
uint8_t errorCounterDHT = 0;

// Brightness and LDR
uint8_t maxBrightness = 0;
uint8_t brightness = 0;
#ifdef LDR
uint8_t iTargetBrightness = 0;
unsigned long iBrightnessMillis = 0;
#endif

// Alarm
#ifdef BUZZER
bool alarmTimerSet = false;
uint8_t alarmTimer = 0;
uint8_t alarmTimerSecond = 0;
uint8_t alarmOn = false;
#endif

// Events
#ifdef EVENT_TIME
uint32_t showEventTimer = EVENT_TIME;
#endif

// Misc
IPAddress myIP = {0, 0, 0, 0};
uint32_t lastButtonPress = 0;
bool testFlag = false;
uint8_t testColumn = 0;
#ifdef DEBUG_FPS
int fps = 0;
#endif

struct tm getTime()
{
    time_t now = time(nullptr);
    struct tm *tmNow = localtime(&now);

    // Return by value (this creates a local copy so it's thread-safe)
    if (tmNow == nullptr)
    {
        return {}; // Return empty struct if error
    }
    return *tmNow;
}

uint8_t getHour(time_t zeit)
{
    return zeit / 3600;
}

uint8_t getMinute(time_t zeit)
{
    return (zeit % 3600) / 60;
}

void handleTimeSetting(String input) // 2026-05-01T17:58
{
    int year, month, day, hour, minute, second = 0;

    int parsed = sscanf(input.c_str(), "%d-%d-%dT%d:%d",
                        &year, &month, &day, &hour, &minute);

    if (parsed == 5)
    {
        struct tm t;
        t.tm_year = year - 1900;
        t.tm_mon = month - 1;
        t.tm_mday = day;
        t.tm_hour = hour;
        t.tm_min = minute;
        t.tm_sec = second;
        t.tm_isdst = -1;

        time_t epoch = mktime(&t);

        if (epoch != -1)
        {
            struct timeval tv;
            tv.tv_sec = epoch;
            tv.tv_usec = 0;
            settimeofday(&tv, NULL);

            Serial.println(F("Manual time set"));
        }
        else
        {
            Serial.println(F("[ERROR] Wrong date"));
        }
    }
    else
    {
        Serial.println(F("[ERROR] Wrong format"));
    }
}

// Calculate moonphase
#ifdef SHOW_MODE_MOONPHASE
int getMoonphase(int y, int m, int d)
{
    int b = 0;
    int c = 0;
    int e = 0;
    double jd = 0;

    if (m < 3)
    {
        y--;
        m += 12;
    }
    ++m;
    c = 365.25 * y;
    e = 30.6 * m;
    jd = c + e + d - 694039.09; // jd is total days elapsed
    jd /= 29.53;                // divide by the moon cycle (29.53 days)
    b = jd;                     // int(jd) -> b, take integer part of jd
    jd -= b;                    // subtract integer part to leave fractional part of original jd
    b = jd * 8 + 0.5;           // scale fraction from 0-8 and round by adding 0.5
    b = b & 7;                  // 0 and 8 are the same so turn 8 into 0
    return b;
}
#endif

