ch570512/Qlockwork/src/main.cpp
//=============================================================================
// Setup()
//=============================================================================

void setup()
{
    // Init serial port
    Serial.begin(115200);
    while (!Serial && millis() < 5000)
        ;
    delay(1000);

    // And the monkey flips the switch. (Akiva Goldsman)
    Serial.println(F("\n\n*** QLOCKWORK ***"));
    Serial.print(F("Firmware: ") + String(FIRMWARE_VERSION));
    Serial.print(F("\nStarting on ") + String(ARDUINO_BOARD));
    Serial.print(F("\nCPU Frequency = "));
    Serial.print(F_CPU / 1000000);
    Serial.println(F(" MHz"));

    // Load settings
    settings.loadFromEEPROM();
    maxBrightness = map(settings.mySettings.brightness, 0, 100, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    brightness = maxBrightness;

#ifdef POWERON_SELFTEST
    renderer.setAllScreenBuffer(matrix);
    Serial.println(F("Set all LEDs to red."));
    writeScreenBuffer(matrix, RED, brightness);
    delay(2500);
    Serial.println(F("Set all LEDs to green."));
    writeScreenBuffer(matrix, GREEN, brightness);
    delay(2500);
    Serial.println(F("Set all LEDs to blue."));
    writeScreenBuffer(matrix, BLUE, brightness);
    delay(2500);
    Serial.println(F("Set all LEDs to white."));
    writeScreenBuffer(matrix, WHITE, brightness);
    delay(2500);
#endif

#ifdef ESP_LED
    Serial.println(F("Setting up ESP-LED"));
    pinMode(PIN_LED, OUTPUT);
    digitalWrite(PIN_LED, HIGH);
#endif

#ifdef MODE_BUTTON
    Serial.println(F("Setting up Mode-Button."));
    pinMode(PIN_MODE_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_MODE_BUTTON), buttonModeInterrupt, FALLING);
#endif

#ifdef ONOFF_BUTTON
    Serial.println(F("Setting up Back-Button."));
    pinMode(PIN_ONOFF_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_ONOFF_BUTTON), buttonOnOffInterrupt, FALLING);
#endif

#ifdef TIME_BUTTON
    Serial.println(F("Setting up Time-Button."));
    pinMode(PIN_TIME_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_TIME_BUTTON), buttonTimeInterrupt, FALLING);
#endif

#ifdef BUZZER
    Serial.println(F("Setting up Buzzer"));
    pinMode(PIN_BUZZER, OUTPUT);
#endif

#ifdef SENSOR_DHT22
    Serial.println(F("Setting up DHT22"));
    dht.begin();
#endif

#ifdef LDR
    Serial.print(F("Setting up LDR. ABC: "));
    settings.mySettings.useAbc ? Serial.println(F("enabled")) : Serial.println(F("disabled"));
    pinMode(PIN_LDR, INPUT);
#endif

#ifdef IR_RECEIVER
    Serial.println(F("Setting up IR-Receiver"));
    irrecv.enableIRIn();
#endif

    // Start WiFi
    renderer.clearScreenBuffer(matrix);
    renderer.setSmallText("WI", TEXT_POS_TOP, matrix);
    renderer.setSmallText("FI", TEXT_POS_BOTTOM, matrix);
    writeScreenBuffer(matrix, WHITE, brightness);
    WiFiManager wifiManager;
    // wifiManager.resetSettings();
    wifiManager.setConnectTimeout(30);
    wifiManager.setTimeout(120);
    wifiManager.autoConnect(HOSTNAME, WIFI_AP_PASS);
    WiFi.hostname(HOSTNAME);
    WiFi.setAutoConnect(true);
    WiFi.setAutoReconnect(true);
    if (!WiFi.isConnected())
    {
        // WiFi.mode(WIFI_AP);
        Serial.println(F("No WiFi connected"));
        writeScreenBuffer(matrix, RED, brightness);
        delay(1000);
        // myIP = WiFi.softAPIP();
    }
    else
    {
        WiFi.mode(WIFI_STA);
        Serial.println("Hostname: " + String(HOSTNAME));
        Serial.println("RSSI: " + String(WiFi.RSSI()));
        writeScreenBuffer(matrix, GREEN, brightness);
        delay(1000);
        myIP = WiFi.localIP();
    }

#ifdef SHOW_IP
    // WiFi.isConnected() ? feedText = "  IP: " : feedText = "  AP-IP: ";
    feedText = "  IP: ";
    feedText += String(myIP[0]) + "." + String(myIP[1]) + "." + String(myIP[2]) + "." + String(myIP[3]) + "   ";
    feedPosition = 0;
    feedColor = WHITE;
    mode = MODE_FEED;
#endif

#ifdef WEBSERVER
    Serial.println(F("Starting webserver"));
    setupWebServer();
#endif

#ifdef ARDUINO_OTA
    Serial.println(F("Starting OTA"));
    ArduinoOTA.begin();
#endif

    renderer.clearScreenBuffer(matrix);

    // Configure NTP
    configTime(NTP_TIMEZONE, NTP_SERVER);
    DEBUG_SERIAL_PRINTLN(F("NTP Server: ") + String(NTP_SERVER));
    DEBUG_SERIAL_PRINTLN(F("NTP Timezone: ") + String(NTP_TIMEZONE));
    time_t now_time_t = time(nullptr);
    while (now_time_t < 8 * 3600 * 2)
    {
        delay(500);
        now_time_t = time(nullptr);
    }
    struct tm tmNow = getTime();
    Serial.printf("Time (ESP): %02d:%02d:%02d %02d.%02d.%02d \n", tmNow.tm_hour, tmNow.tm_min, tmNow.tm_sec, tmNow.tm_mday, tmNow.tm_mon + 1, tmNow.tm_year + 1900);

    // Get weather from MeteoWeather
#ifdef WEATHER
    !outdoorWeather.getOutdoorConditions(LATITUDE, LONGITUDE, TIMEZONE) ? errorCounterOutdoorWeather++ : errorCounterOutdoorWeather = 0;
#ifdef DEBUG
    Serial.print(F("Outdoor temperature: "));
    Serial.print(outdoorWeather.temperature);
    Serial.println(F(" °C"));
    Serial.print(F("Outdoor humidity: "));
    Serial.print(outdoorWeather.humidity);
    Serial.println(F(" %rH"));
    struct tm *sunriseTime = localtime(&outdoorWeather.sunrise);
    Serial.printf("Sunrise: %02u:%02u\n", sunriseTime->tm_hour, sunriseTime->tm_min);
    struct tm *sunsetTime = localtime(&outdoorWeather.sunset);
    Serial.printf("Sunset: %02u:%02u\n", sunsetTime->tm_hour, sunsetTime->tm_min);

#endif
#endif

    // Define a random time
    randomSeed(analogRead(A0));
    randomHour = random(0, 24);
    randomMinute = random(5, 56);

    // Print some infos
#ifdef DEBUG
#ifdef EVENT_TIME
    Serial.printf("Events: %u\n", sizeof(events) / sizeof(event_t) - 1);
#endif
    Serial.printf("Day on: %02u:%02u\n", getHour(settings.mySettings.dayOnTime), getMinute(settings.mySettings.dayOnTime));
    Serial.printf("Night off: %02u:%02u\n", getHour(settings.mySettings.nightOffTime), getMinute(settings.mySettings.nightOffTime));
    Serial.printf("Alarm1: %02u:%02u\n", getHour(settings.mySettings.alarm1Time), getMinute(settings.mySettings.alarm1Time));
    settings.mySettings.alarm1 ? Serial.print("on ") : Serial.print("off ");
    Serial.println(settings.mySettings.alarm1Weekdays, BIN);
    Serial.printf("Alarm2: %02u:%02u\n", getHour(settings.mySettings.alarm2Time), getMinute(settings.mySettings.alarm2Time));
    settings.mySettings.alarm2 ? Serial.print("on ") : Serial.print("off ");
    Serial.println(settings.mySettings.alarm2Weekdays, BIN);
    Serial.printf("Random time: %02u:%02u\n", randomHour, randomMinute);
    Serial.println("DEBUG enabled.");
#else
    Serial.println(F("DEBUG disabled."));
#endif

#ifdef FRONTCOVER_BINARY
    settings.mySettings.transition = TRANSITION_NORMAL;
#endif
} // setup()

