ch570512/Qlockwork/src/main.cpp
#ifdef SHOW_MODE_AMPM
        case MODE_AMPM:
            renderer.clearScreenBuffer(matrix);
            tmNow.tm_hour < 12 ? renderer.setSmallText("AM", TEXT_POS_MIDDLE, matrix) : renderer.setSmallText("PM", TEXT_POS_MIDDLE, matrix);
            break;
#endif

#ifdef SHOW_MODE_SECONDS
        case MODE_SECONDS:
            renderer.clearScreenBuffer(matrix);
            renderer.setCorners(tmNow.tm_min, matrix);
            for (uint8_t i = 0; i <= 6; i++)
            {
                matrix[1 + i] |= numbersBig[tmNow.tm_sec / 10][i] << 11;
                matrix[1 + i] |= numbersBig[tmNow.tm_sec % 10][i] << 5;
            }
            break;
#endif

#ifdef SHOW_MODE_WEEKDAY
        case MODE_WEEKDAY:
            renderer.clearScreenBuffer(matrix);
            renderer.setSmallText(String(sWeekday[tmNow.tm_wday][0]) + String(sWeekday[tmNow.tm_wday][1]), TEXT_POS_MIDDLE, matrix);
            break;
#endif

#ifdef SHOW_MODE_DATE
        case MODE_DATE:
            renderer.clearScreenBuffer(matrix);
            if (tmNow.tm_mday < 10)
                renderer.setSmallText(("0" + String(tmNow.tm_mday)), TEXT_POS_TOP, matrix);
            else
                renderer.setSmallText(String(tmNow.tm_mday), TEXT_POS_TOP, matrix);
            if (tmNow.tm_mday < 10)
                renderer.setSmallText(("0" + String(tmNow.tm_mday)), TEXT_POS_BOTTOM, matrix);
            else
                renderer.setSmallText(String(tmNow.tm_mday), TEXT_POS_BOTTOM, matrix);
            renderer.setPixelInScreenBuffer(5, 4, matrix);
            renderer.setPixelInScreenBuffer(5, 9, matrix);
            break;
#endif

#ifdef SHOW_MODE_MOONPHASE
        case MODE_MOONPHASE:
            renderer.clearScreenBuffer(matrix);
            switch (moonphase)
            {
            case 0:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0011000110000000;
                matrix[2] = 0b0100000001000000;
                matrix[3] = 0b0100000001000000;
                matrix[4] = 0b1000000000100000;
                matrix[5] = 0b1000000000100000;
                matrix[6] = 0b0100000001000000;
                matrix[7] = 0b0100000001000000;
                matrix[8] = 0b0011000110000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 1:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0000001110000000;
                matrix[2] = 0b0000000111000000;
                matrix[3] = 0b0000000111000000;
                matrix[4] = 0b0000000111100000;
                matrix[5] = 0b0000000111100000;
                matrix[6] = 0b0000000111000000;
                matrix[7] = 0b0000000111000000;
                matrix[8] = 0b0000001110000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 2:
                matrix[0] = 0b0000011000000000;
                matrix[1] = 0b0000011110000000;
                matrix[2] = 0b0000011111000000;
                matrix[3] = 0b0000011111000000;
                matrix[4] = 0b0000011111100000;
                matrix[5] = 0b0000011111100000;
                matrix[6] = 0b0000011111000000;
                matrix[7] = 0b0000011111000000;
                matrix[8] = 0b0000011110000000;
                matrix[9] = 0b0000011000000000;
                break;
            case 3:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0001111110000000;
                matrix[2] = 0b0001111111000000;
                matrix[3] = 0b0001111111000000;
                matrix[4] = 0b0001111111100000;
                matrix[5] = 0b0001111111100000;
                matrix[6] = 0b0001111111000000;
                matrix[7] = 0b0001111111000000;
                matrix[8] = 0b0001111110000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 4:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0011111110000000;
                matrix[2] = 0b0111111111000000;
                matrix[3] = 0b0111111111000000;
                matrix[4] = 0b1111111111100000;
                matrix[5] = 0b1111111111100000;
                matrix[6] = 0b0111111111000000;
                matrix[7] = 0b0111111111000000;
                matrix[8] = 0b0011111110000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 5:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0011111100000000;
                matrix[2] = 0b0111111100000000;
                matrix[3] = 0b0111111100000000;
                matrix[4] = 0b1111111100000000;
                matrix[5] = 0b1111111100000000;
                matrix[6] = 0b0111111100000000;
                matrix[7] = 0b0111111100000000;
                matrix[8] = 0b0011111100000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 6:
                matrix[0] = 0b0000110000000000;
                matrix[1] = 0b0011110000000000;
                matrix[2] = 0b0111110000000000;
                matrix[3] = 0b0111110000000000;
                matrix[4] = 0b1111110000000000;
                matrix[5] = 0b1111110000000000;
                matrix[6] = 0b0111110000000000;
                matrix[7] = 0b0111110000000000;
                matrix[8] = 0b0011110000000000;
                matrix[9] = 0b0000110000000000;
                break;
            case 7:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0011100000000000;
                matrix[2] = 0b0111000000000000;
                matrix[3] = 0b0111000000000000;
                matrix[4] = 0b1111000000000000;
                matrix[5] = 0b1111000000000000;
                matrix[6] = 0b0111000000000000;
                matrix[7] = 0b0111000000000000;
                matrix[8] = 0b0011100000000000;
                matrix[9] = 0b0000111000000000;
                break;
            }
            break;
#endif

