ch570512/Qlockwork/src/main.cpp
#if defined(SENSOR_DHT22)
        case MODE_TEMP:
#ifdef DEBUG
            Serial.println("Room Temperature: " + String(roomTemperature) + " �C");
#endif
            renderer.clearScreenBuffer(matrix);
            if (roomTemperature == 0)
            {
                matrix[0] = 0b0000000001000000;
                matrix[1] = 0b0000000010100000;
                matrix[2] = 0b0000000010100000;
                matrix[3] = 0b0000000011100000;
            }
            if (roomTemperature > 0)
            {
                matrix[0] = 0b0000000001000000;
                matrix[1] = 0b0100000010100000;
                matrix[2] = 0b1110000010100000;
                matrix[3] = 0b0100000011100000;
            }
            if (roomTemperature < 0)
            {
                matrix[0] = 0b0000000001000000;
                matrix[1] = 0b0000000010100000;
                matrix[2] = 0b1110000010100000;
                matrix[3] = 0b0000000011100000;
            }
            renderer.setSmallText(String(int(abs(roomTemperature) + 0.5)), TEXT_POS_BOTTOM, matrix);
            break;

#ifdef SENSOR_DHT22
        case MODE_HUMIDITY:
#ifdef DEBUG
            Serial.println("Room Humidity: " + String(roomHumidity) + " %rH");
#endif
            renderer.clearScreenBuffer(matrix);
            renderer.setSmallText(String(int(roomHumidity + 0.5)), TEXT_POS_TOP, matrix);
            matrix[6] = 0b0100100001000000;
            matrix[7] = 0b0001000010100000;
            matrix[8] = 0b0010000010100000;
            matrix[9] = 0b0100100011100000;
            break;
#endif
#endif

#ifdef WEATHER
        case MODE_EXT_TEMP:
#ifdef DEBUG
            Serial.println("Outdoor temperature: " + String(outdoorWeather.temperature) + "°C");
#endif
            renderer.clearScreenBuffer(matrix);
            if (outdoorWeather.temperature > 0)
            {
                matrix[1] = 0b0100000000000000;
                matrix[2] = 0b1110000000000000;
                matrix[3] = 0b0100000000000000;
            }
            if (outdoorWeather.temperature < 0)
                matrix[2] = 0b1110000000000000;
            renderer.setSmallText(String(int(abs(outdoorWeather.temperature) + 0.5)), TEXT_POS_BOTTOM, matrix);
            break;
        case MODE_EXT_HUMIDITY:
#ifdef DEBUG
            Serial.println("Outdoor humidity: " + String(outdoorWeather.humidity) + " %rH");
#endif
            renderer.clearScreenBuffer(matrix);
            if (outdoorWeather.humidity < 100)
                renderer.setSmallText(String(outdoorWeather.humidity), TEXT_POS_TOP, matrix);
            else
            {
                matrix[0] = 0b0010111011100000;
                matrix[1] = 0b0110101010100000;
                matrix[2] = 0b0010101010100000;
                matrix[3] = 0b0010101010100000;
                matrix[4] = 0b0010111011100000;
            }
            matrix[6] = 0b0100100000000000;
            matrix[7] = 0b0001000000000000;
            matrix[8] = 0b0010000000000000;
            matrix[9] = 0b0100100000000000;
            break;
#endif

#ifdef BUZZER
        case MODE_TIMER:
            renderer.clearScreenBuffer(matrix);
            renderer.setSmallText("TI", TEXT_POS_TOP, matrix);
            renderer.setSmallText(String(alarmTimer), TEXT_POS_BOTTOM, matrix);
            break;
#endif

#ifdef SHOW_MODE_TEST
        case MODE_TEST:
            renderer.clearScreenBuffer(matrix);
            if (testColumn == 10)
                testColumn = 0;
            matrix[testColumn] = 0b1111111111110000;
            testColumn++;
            break;
        case MODE_RED:
        case MODE_GREEN:
        case MODE_BLUE:
        case MODE_WHITE:
            renderer.setAllScreenBuffer(matrix);
            testFlag = true;
            break;
#endif

        case MODE_COUNT:
        {
        }

        case MODE_BLANK:
            renderer.clearScreenBuffer(matrix);
            break;

        case MODE_FEED:
            for (uint8_t y = 0; y <= 5; y++)
            {
                renderer.clearScreenBuffer(matrix);
                for (uint8_t z = 0; z <= 6; z++)
                {
                    matrix[2 + z] |= (lettersBig[feedText[feedPosition] - 32][z] << (11 + y)) & 0b1111111111100000;
                    matrix[2 + z] |= (lettersBig[feedText[feedPosition + 1] - 32][z] << (5 + y)) & 0b1111111111100000;
                    matrix[2 + z] |= (lettersBig[feedText[feedPosition + 2] - 32][z] << (y - 1)) & 0b1111111111100000;
                }
                writeScreenBuffer(matrix, feedColor, brightness);
                delay(120);
            }
            feedPosition++;
            if (feedPosition == feedText.length() - 2)
            {
                feedPosition = 0;
                setMode(MODE_TIME);
            }
            break;
        }

        // turn off LED behind IR-sensor
#ifdef IR_LETTER_OFF
        renderer.unsetPixelInScreenBuffer(IR_LETTER_X, IR_LETTER_Y - 1, matrix);
#endif

#ifdef DEBUG_MATRIX
        // debugScreenBuffer(matrixOld);
        debugScreenBuffer(matrix);
#endif

        // write screenbuffer to display
        switch (mode)
        {
        case MODE_TIME:
        case MODE_BLANK:
            if (settings.mySettings.transition == TRANSITION_NORMAL)
                writeScreenBuffer(matrix, settings.mySettings.color, brightness);
            if (settings.mySettings.transition == TRANSITION_FADE)
                writeScreenBufferFade(matrixOld, matrix, settings.mySettings.color, brightness);
            if (settings.mySettings.transition == TRANSITION_MOVEUP)
            {
                if (tmNow.tm_min % 5 == 0)
                    moveScreenBufferUp(matrixOld, matrix, settings.mySettings.color, brightness);
                else
                    writeScreenBuffer(matrix, settings.mySettings.color, brightness);
            }
            break;
#ifdef SHOW_MODE_TEST
        case MODE_RED:
            writeScreenBuffer(matrix, RED, brightness);
            break;
        case MODE_GREEN:
            writeScreenBuffer(matrix, GREEN, brightness);
            break;
        case MODE_BLUE:
            writeScreenBuffer(matrix, BLUE, brightness);
            break;
        case MODE_WHITE:
            writeScreenBuffer(matrix, WHITE, brightness);
            break;
#endif
        case MODE_FEED:
            writeScreenBuffer(matrix, feedColor, brightness);
            break;
        default:
            if (runTransitionOnce)
            {
                // if (settings.mySettings.transition == TRANSITION_NORMAL)
                //     writeScreenBuffer(matrix, settings.mySettings.color, brightness);
                // if (settings.mySettings.transition == TRANSITION_FADE)
                //     writeScreenBufferFade(matrixOld, matrix, settings.mySettings.color, brightness);
                // if (settings.mySettings.transition == TRANSITION_MOVEUP)
                //     moveScreenBufferUp(matrixOld, matrix, settings.mySettings.color, brightness);
                moveScreenBufferUp(matrixOld, matrix, settings.mySettings.color, brightness);
                runTransitionOnce = false;
                testColumn = 0;
            }
            else
                writeScreenBuffer(matrix, settings.mySettings.color, brightness);
            break;
        }
    }

