ch570512/Qlockwork/src/main.cpp
    // Wait for mode timeout then switch back to time
    if ((millis() > (modeTimeout + settings.mySettings.timeout * 1000)) && modeTimeout)
    {
        setMode(MODE_TIME);
    }

#ifdef DEBUG_FPS
    // debugFps();
    fps++;
#endif
} // loop()

//=============================================================================
// Transitions
//=============================================================================

void writeScreenBuffer(uint16_t screenBuffer[], uint8_t color, uint8_t brightness)
{
    ledDriver.clear();
    for (uint8_t y = 0; y <= 9; y++)
    {
        for (uint8_t x = 0; x <= 10; x++)
        {
            if (bitRead(screenBuffer[y], 15 - x))
            {
                ledDriver.setPixel(x, y, color, brightness);
            }
        }
    }

    // Corner LEDs
    for (uint8_t y = 0; y <= 3; y++)
    {
        if (bitRead(screenBuffer[y], 4))
        {
            ledDriver.setPixel(110 + y, color, brightness);
        }
    }

    // Alarm LED
#ifdef BUZZER
    if (bitRead(screenBuffer[4], 4))
    {
#ifdef ALARM_LED_COLOR
#ifdef ABUSE_CORNER_LED_FOR_ALARM
        if (settings.mySettings.alarm1 || settings.mySettings.alarm2 || alarmTimerSet)
        {
            ledDriver.setPixel(111, ALARM_LED_COLOR, brightness);
        }
        else if (bitRead(screenBuffer[1], 4))
        {
            ledDriver.setPixel(111, color, brightness);
        }
#else
        ledDriver.setPixel(114, ALARM_LED_COLOR, brightness);
#endif
#else
        ledDriver.setPixel(114, color, brightness);
#endif
    }
#endif

    ledDriver.show();
} // writeScreenBuffer

void moveScreenBufferUp(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness)
{
    for (uint8_t z = 0; z <= 9; z++)
    {
        for (uint8_t i = 0; i <= 8; i++)
        {
            screenBufferOld[i] = screenBufferOld[i + 1];
        }
        screenBufferOld[9] = screenBufferNew[z];
        writeScreenBuffer(screenBufferOld, color, brightness);
        delay(50);
    }
} // moveScreenBufferUp

void writeScreenBufferFade(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness)
{
    ledDriver.clear();
    uint8_t brightnessBuffer[10][12] = {};

    // Copy old matrix to buffer
    for (uint8_t y = 0; y <= 9; y++)
    {
        for (uint8_t x = 0; x <= 11; x++)
        {
            if (bitRead(screenBufferOld[y], 15 - x))
            {
                brightnessBuffer[y][x] = brightness;
            }
        }
    }

    // Fade old to new matrix
    for (uint8_t i = 0; i < brightness; i++)
    {
        for (uint8_t y = 0; y <= 9; y++)
        {
            for (uint8_t x = 0; x <= 11; x++)
            {
                if (!(bitRead(screenBufferOld[y], 15 - x)) && (bitRead(screenBufferNew[y], 15 - x)))
                {
                    brightnessBuffer[y][x]++;
                }
                if ((bitRead(screenBufferOld[y], 15 - x)) && !(bitRead(screenBufferNew[y], 15 - x)))
                {
                    brightnessBuffer[y][x]--;
                }
                ledDriver.setPixel(x, y, color, brightnessBuffer[y][x]);
            }
        }

        // Corner LEDs
        for (uint8_t y = 0; y <= 3; y++)
        {
            ledDriver.setPixel(110 + y, color, brightnessBuffer[y][11]);
        }

        // Alarm LED
#ifdef BUZZER
#ifdef ALARM_LED_COLOR
#ifdef ABUSE_CORNER_LED_FOR_ALARM
        if (settings.mySettings.alarm1 || settings.mySettings.alarm2 || alarmTimerSet)
        {
            ledDriver.setPixel(111, ALARM_LED_COLOR, brightnessBuffer[4][11]);
        }
        else
        {
            ledDriver.setPixel(111, color, brightnessBuffer[1][11]);
        }
#else
        ledDriver.setPixel(114, ALARM_LED_COLOR, brightnessBuffer[4][11]);
#endif
#else
        ledDriver.setPixel(114, color, brightnessBuffer[4][11]);
#endif
#endif
        ledDriver.show();
    }
} // writeScreenBufferFade

//=============================================================================
// "On/off" pressed
//=============================================================================

#ifdef ONOFF_BUTTON
ICACHE_RAM_ATTR void buttonOnOffInterrupt()
{
    if (millis() > lastButtonPress + 250)
    {
        lastButtonPress = millis();
        buttonOnOffPressed();
    }
}
#endif

void buttonOnOffPressed()
{
#ifdef DEBUG
    Serial.println("On/off pressed");
#endif
    mode == MODE_BLANK ? setLedsOn() : setLedsOff();
}

//=============================================================================
// "Time" pressed
//=============================================================================

#ifdef TIME_BUTTON
ICACHE_RAM_ATTR void buttonTimeInterrupt()
{
    if (millis() > lastButtonPress + 250)
    {
        lastButtonPress = millis();
        buttonTimePressed();
    }
}
#endif

void buttonTimePressed()
{
#ifdef DEBUG
    Serial.println("Time pressed");
#endif

    // Switch off alarm
#ifdef BUZZER
    if (alarmOn)
    {
#ifdef DEBUG
        Serial.println("Alarm: off");
#endif
        digitalWrite(PIN_BUZZER, LOW);
        alarmOn = false;
    }
#endif
    modeTimeout = 0;
    setMode(MODE_TIME);
}

//=============================================================================
// "Mode" pressed
//=============================================================================

#ifdef MODE_BUTTON
ICACHE_RAM_ATTR void buttonModeInterrupt()
{
    if (millis() > lastButtonPress + 250)
    {
        lastButtonPress = millis();
        buttonModePressed();
    }
}
#endif

void buttonModePressed()
{
#ifdef DEBUG
    Serial.println("Mode pressed");
#endif

    // Switch off alarm
#ifdef BUZZER
    if (alarmOn)
    {
#ifdef DEBUG
        Serial.println("Alarm: off");
#endif
        digitalWrite(PIN_BUZZER, LOW);
        alarmOn = false;
        setMode(MODE_TIME);
        return;
    }
#endif
    setMode(mode++);
}

