ch570512/Qlockwork/src/main.cpp
//=============================================================================
// Set mode
//=============================================================================

void setMode(Mode newMode)
{
    screenBufferNeedsUpdate = true;
    runTransitionOnce = true;
    lastMode = mode;
    mode = newMode;

    // set timeout for selected mode
    switch (mode)
    {
#ifdef SHOW_MODE_AMPM
    case MODE_AMPM:
#endif
#ifdef SHOW_MODE_SECONDS
    case MODE_SECONDS:
#endif
#ifdef SHOW_MODE_WEEKDAY
    case MODE_WEEKDAY:
#endif
#ifdef SHOW_MODE_DATE
    case MODE_DATE:
#endif
#ifdef SHOW_MODE_MOONPHASE
    case MODE_MOONPHASE:
#endif
#ifdef SENSOR_DHT22
    case MODE_TEMP:
    case MODE_HUMIDITY:
#endif
#ifdef WEATHER
    case MODE_EXT_TEMP:
    case MODE_EXT_HUMIDITY:
#endif
        modeTimeout = millis();
        break;
    default:
        modeTimeout = 0;
        break;
    }
}

//=============================================================================
// Get reading from LDR
//=============================================================================

#ifdef LDR
uint8_t getBrightnessFromLDR()
{
    uint16_t ldrValue = 0;
    static uint16_t lastLdrValue = 0;
    static uint16_t minLdrValue = 511;
    static uint16_t maxLdrValue = 512;

#ifdef LDR_IS_INVERSE
    ldrValue = 1023 - analogRead(PIN_LDR);
#else
    ldrValue = analogRead(PIN_LDR);
#endif

    if (ldrValue < minLdrValue)
    {
        minLdrValue = ldrValue;
    }
    if (ldrValue > maxLdrValue)
    {
        maxLdrValue = ldrValue;
    }
    if ((ldrValue >= (lastLdrValue + 30)) || (ldrValue <= (lastLdrValue - 30))) // Hysteresis
    {
        lastLdrValue = ldrValue;
        return map(ldrValue, minLdrValue, maxLdrValue, MIN_BRIGHTNESS, maxBrightness);
    }
    return iTargetBrightness;
}
#endif

//=============================================================================
// Get room conditions
//=============================================================================

#if defined(SENSOR_DHT22)
void getRoomConditions()
{
    float dhtTemperature = dht.readTemperature();
    float dhtHumidity = dht.readHumidity();
    if (!isnan(dhtTemperature) && !isnan(dhtHumidity))
    {
        errorCounterDHT = 0;
        roomTemperature = dhtTemperature + DHT_TEMPERATURE_OFFSET;
        roomHumidity = dhtHumidity + DHT_HUMIDITY_OFFSET;
#ifdef DEBUG
        Serial.println("Temperature (DHT): " + String(roomTemperature) + " °C");
        Serial.println("Humidity (DHT): " + String(roomHumidity) + " %rH");
#endif
    }
    else
    {
        if (errorCounterDHT < 255)
        {
            errorCounterDHT++;
        }
#ifdef DEBUG
        Serial.printf("Error (DHT): %u\n", errorCounterDHT);
#endif
    }
}
#endif

//=============================================================================
// Misc
//=============================================================================

// Switch off LEDs
void setLedsOff()
{
#ifdef DEBUG
    Serial.println("LEDs: off");
#endif
    setMode(MODE_BLANK);
}

// Switch on LEDs
void setLedsOn()
{
#ifdef DEBUG
    Serial.println("LEDs: on");
#endif
    setMode(lastMode);
}

String padStringZeros(String input)
{
    return (input.length() > 1) ? input : "0" + input;
}

//=============================================================================
// Webserver
//=============================================================================

#ifdef WEBSERVER
void setupWebServer()
{
    webServer.onNotFound([]()
                         { handleNotFound(webServer); });
    webServer.on("/", handleRoot);
    webServer.on("/handleButtonOnOff", []()
                 { buttonOnOffPressed(); callRoot(); });
    webServer.on("/handleButtonSettings", handleButtonSettings);
    webServer.on("/handleButtonMode", []()
                 { buttonModePressed(); callRoot(); });
    webServer.on("/handleButtonTime", []()
                 {    buttonTimePressed(); callRoot(); });
    webServer.on("/commitSettings", handleCommitSettings);
    webServer.on("/reset", []()
                 { handleReset(webServer); });
    webServer.on("/setEvent", handleSetEvent);
    webServer.on("/showText", handleShowText);
    webServer.on("/control", handleControl);
    webServer.begin();
}

void callRoot()
{
    webServer.send(200, "text/html", "<!doctype html><html><head><script>window.onload=function(){window.location.replace('/');}</script></head></html>");
}

// Page /
void handleRoot()
{
    String message = "<!doctype html>"
                     "<html>"
                     "<head>"
                     "<title>" +
                     String(WEBSITE_TITLE) +
                     "</title>"
                     "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">"
                     "<meta http-equiv=\"refresh\" content=\"60\" charset=\"UTF-8\">"
                     "<link rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css\">"
                     "<style>"
                     "body{background-color:#FFFFFF;text-align:center;color:#333333;font-family:Sans-serif;font-size:16px;}"
                     "button{background-color:#1FA3EC;text-align:center;color:#FFFFFF;width:200px;padding:10px;border:5px solid #FFFFFF;font-size:24px;border-radius:10px;}"
                     "</style>"
                     "</head>"
                     "<body>"
                     "<h1>" +
                     String(WEBSITE_TITLE) +
                     "</h1>";
#ifdef DEDICATION
    message += DEDICATION;
    message += "<br><br>";
#endif
    if (mode == MODE_BLANK)
        message += "<button title=\"Switch LEDs on\" onclick=\"window.location.href='/handleButtonOnOff'\"><i class=\"fa fa-toggle-off\"></i></button>";
    else
        message += "<button title=\"Switch LEDs off\" onclick=\"window.location.href='/handleButtonOnOff'\"><i class=\"fa fa-toggle-on\"></i></button>";
    message += "<button title=\"Settings\" onclick=\"window.location.href='/handleButtonSettings'\"><i class=\"fa fa-gear\"></i></button>"
               "<br><br>"
               "<button title=\"Switch modes\" onclick=\"window.location.href='/handleButtonMode'\"><i class=\"fa fa-bars\"></i></button>"
               "<button title=\"Return to time\" onclick=\"window.location.href='/handleButtonTime'\"><i class=\"fa fa-clock-o\"></i></button>";
#ifdef SENSOR_DHT22
    message += "<br><br><i class = \"fa fa-home\" style=\"font-size:20px;\"></i>";
    message += "<br><i class=\"fa fa-thermometer\" style=\"font-size:20px;\"></i> " + String(roomTemperature) + "&deg;C / " + String(roomTemperature * 1.8 + 32.0) + "&deg;F";
    message += "<br><i class=\"fa fa-tint\" style=\"font-size:20px;\"></i> " + String(roomHumidity) + "%rH"
                                                                                                      "<br><span style=\"font-size:20px;\">";
    if (roomHumidity < 30)
        message += "<i style=\"color:Red;\" class=\"fa fa-square\"\"></i>";
    else
        message += "<i style=\"color:Red;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity >= 30) && (roomHumidity < 40))
        message += "&nbsp;<i style=\"color:Orange;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Orange;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity >= 40) && (roomHumidity <= 50))
        message += "&nbsp;<i style=\"color:MediumSeaGreen;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:MediumSeaGreen;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity > 50) && (roomHumidity < 60))
        message += "&nbsp;<i style=\"color:Lightblue;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Lightblue;\" class=\"fa fa-square-o\"></i>";
    if (roomHumidity >= 60)
        message += "&nbsp;<i style=\"color:Blue;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Blue;\" class=\"fa fa-square-o\"></i>";
    message += "</span>";
#endif
#ifdef WEATHER
    message += "<br><br><i class = \"fa fa-tree\" style=\"font-size:20px;\"></i>"
               "<br><i class = \"fa fa-thermometer\" style=\"font-size:20px;\"></i> " +
               String(outdoorWeather.temperature) + "&deg;C / " + String(outdoorWeather.temperature * 1.8 + 32.0) + "&deg;F" +
               "<br><i class = \"fa fa-tint\" style=\"font-size:20px;\"></i> " + String(outdoorWeather.humidity) + "%rH" +
               "<br>" + String(outdoorWeather.pressure) + " hPa / " + String(outdoorWeather.pressure / 33.865) + " inHg";

    struct tm *sunriseTime = localtime(&outdoorWeather.sunrise);
    message += "<br><i class = \"fa fa-sun-o\" style=\"font-size:20px;\"></i> " + String(sunriseTime->tm_hour) + ":" + String(sunriseTime->tm_min);

    struct tm *sunsetTime = localtime(&outdoorWeather.sunset);
    message += " <i class = \"fa fa-moon-o\" style=\"font-size:20px;\"></i> " + String(sunsetTime->tm_hour) + ":" + String(sunsetTime->tm_min);
#endif
    message += "<span style=\"font-size:12px;\">"
               "<br><br><a href=\"https://github.com/ch570512/Qlockwork\">Qlockwork</a> was <i class=\"fa fa-code\"></i> with <i class=\"fa fa-heart\"></i> by ch570512"
               "<br>Firmware: " +
               String(FIRMWARE_VERSION);
#ifdef DEBUG_WEB
    struct tm tmNow = getTime();
    message += "<br><br>Time: " + String(tmNow.tm_hour) + ":";
    if (tmNow.tm_min < 10)
        message += "0";
    message += String(tmNow.tm_min);
    if (tmNow.tm_isdst)
        message += " (DST)";
    tm *tm_uptime = gmtime(&upTime);
    message += " up " + String(tm_uptime->tm_yday) + " days, " + String(tm_uptime->tm_hour) + ":";
    if (tm_uptime->tm_min < 10)
        message += "0";
    message += String(tm_uptime->tm_min);
    message += "<br>" + dayOfWeek[tmNow.tm_wday] + ", " + monthOfYear[tmNow.tm_mon] + " " + String(tmNow.tm_mday) + ". " + String(1900 + tmNow.tm_year);
    message += "<br>Moonphase: " + String(moonphase);
    message += "<br>Free RAM: " + String(ESP.getFreeHeap()) + " bytes";
    message += "<br>RSSI: " + String(WiFi.RSSI());
#ifdef LDR
    message += "<br>Brightness: " + String(brightness) + " (ABC: ";
    settings.mySettings.useAbc ? message += "enabled)" : message += "disabled)";
    // settings.mySettings.useAbc ? message += "enabled" : message += "disabled";
    // message += ", min: " + String(MIN_BRIGHTNESS) + ", max : " + String(maxBrightness) + ")";
    // message += "<br>LDR: " + String(ldrValue) + " (min: " + String(minLdrValue) + ", max: " + String(maxLdrValue) + ")";
#endif
    // message += "<br>Error (NTP): " + String(errorCounterNTP);
#ifdef SENSOR_DHT22
    message += "<br>Error (DHT): " + String(errorCounterDHT);
#endif
#ifdef WEATHER
    message += "<br>Error (MeteoWeather): " + String(errorCounterOutdoorWeather);
#endif
    message += "<br>Reset reason: " + ESP.getResetReason();
    message += "<br>Flags: ";
#endif
#ifdef SENSOR_DHT22
    message += "DHT22 ";
#else
    message += "<s>DHT22</s> ";
#endif
#ifdef LDR
    message += "LDR ";
#else
    message += "<s>LDR</s> ";
#endif
#ifdef BUZZER
    message += "BUZZER ";
#else
    message += "<s>BUZZER</s> ";
#endif
#ifdef IR_RECEIVER
    message += "IR_RECEIVER ";
#else
    message += "<s>IR_RECEIVER</s> ";
#endif
#ifdef ESP_LED
    message += "ESP_LED ";
#else
    message += "<s>ESP_LED</s> ";
#endif
#if defined(ONOFF_BUTTON) || defined(MODE_BUTTON) || defined(TIME_BUTTON)
    message += "BUTTONS ";
#else
    message += "<s>BUTTONS</s> ";
#endif
    message += "</span></body></html>";
    webServer.send(200, "text/html", message);
}

