ch570512/Qlockwork/src/main.cpp
void handleCommitSettings()
{
#ifdef DEBUG
    Serial.println(F("Commit settings pressed"));
#endif
    // ------------------------------------------------------------------------
#ifdef BUZZER
    time_t alarmTimeFromWeb = 0;
    webServer.arg("a1") == "0" ? settings.mySettings.alarm1 = false : settings.mySettings.alarm1 = true;
    alarmTimeFromWeb = webServer.arg("a1t").substring(0, 2).toInt() * 3600 + webServer.arg("a1t").substring(3, 5).toInt() * 60;
    if (settings.mySettings.alarm1Time != alarmTimeFromWeb)
        settings.mySettings.alarm1 = true;
    settings.mySettings.alarm1Time = alarmTimeFromWeb;
    settings.mySettings.alarm1Weekdays =
        webServer.arg("a1w1").toInt() +
        webServer.arg("a1w2").toInt() +
        webServer.arg("a1w3").toInt() +
        webServer.arg("a1w4").toInt() +
        webServer.arg("a1w5").toInt() +
        webServer.arg("a1w6").toInt() +
        webServer.arg("a1w7").toInt();
    // ------------------------------------------------------------------------
    webServer.arg("a2") == "0" ? settings.mySettings.alarm2 = false : settings.mySettings.alarm2 = true;
    alarmTimeFromWeb = webServer.arg("a2t").substring(0, 2).toInt() * 3600 + webServer.arg("a2t").substring(3, 5).toInt() * 60;
    if (settings.mySettings.alarm2Time != alarmTimeFromWeb)
        settings.mySettings.alarm2 = true;
    settings.mySettings.alarm2Time = alarmTimeFromWeb;
    settings.mySettings.alarm2Weekdays =
        webServer.arg("a2w1").toInt() +
        webServer.arg("a2w2").toInt() +
        webServer.arg("a2w3").toInt() +
        webServer.arg("a2w4").toInt() +
        webServer.arg("a2w5").toInt() +
        webServer.arg("a2w6").toInt() +
        webServer.arg("a2w7").toInt();
    // ------------------------------------------------------------------------
    webServer.arg("hb") == "0" ? settings.mySettings.hourBeep = false : settings.mySettings.hourBeep = true;
    // ------------------------------------------------------------------------
    if (webServer.arg("ti").toInt())
    {
        alarmTimer = webServer.arg("ti").toInt();
        alarmTimerSecond = 0;
        // alarmTimerSecond = second();
        alarmTimerSet = true;
        setMode(MODE_TIMER);
#ifdef DEBUG
        Serial.println(F("Timer started"));
#endif
    }
    else
    {
        if (alarmTimerSet)
        {
            alarmTimer = 0;
            alarmTimerSecond = 0;
            alarmTimerSet = false;
            setMode(MODE_TIME);
#ifdef DEBUG
            Serial.println(F("Timer stopped"));
#endif
        }
    }
#endif
    // ------------------------------------------------------------------------
#ifdef SENSOR_DHT22
    webServer.arg("mc") == "0" ? settings.mySettings.modeChange = false : settings.mySettings.modeChange = true;
#endif
    // ------------------------------------------------------------------------
#ifdef LDR
    if (webServer.arg("ab") == "0")
    {
        settings.mySettings.useAbc = false;
        brightness = maxBrightness;
    }
    else
        settings.mySettings.useAbc = true;
#endif
    // ------------------------------------------------------------------------
    settings.mySettings.brightness = webServer.arg("br").toInt();
    maxBrightness = map(settings.mySettings.brightness, 0, 100, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    brightness = maxBrightness;
    // ------------------------------------------------------------------------
    settings.mySettings.color = webServer.arg("co").toInt();
    // ------------------------------------------------------------------------
    switch (webServer.arg("cc").toInt())
    {
    case 0:
        settings.mySettings.colorChange = COLORCHANGE_NO;
        break;
    case 1:
        settings.mySettings.colorChange = COLORCHANGE_FIVE;
        break;
    case 2:
        settings.mySettings.colorChange = COLORCHANGE_HOUR;
        break;
    case 3:
        settings.mySettings.colorChange = COLORCHANGE_DAY;
        break;
    }
    // ------------------------------------------------------------------------
    switch (webServer.arg("tr").toInt())
    {
    case 0:
        settings.mySettings.transition = TRANSITION_NORMAL;
        break;
    case 1:
        settings.mySettings.transition = TRANSITION_MOVEUP;
        break;
    case 2:
        settings.mySettings.transition = TRANSITION_FADE;
        break;
    }
    // ------------------------------------------------------------------------
    settings.mySettings.timeout = webServer.arg("to").toInt();
    // ------------------------------------------------------------------------
    settings.mySettings.nightOffTime = webServer.arg("no").substring(0, 2).toInt() * 3600 + webServer.arg("no").substring(3, 5).toInt() * 60;
    // ------------------------------------------------------------------------
    settings.mySettings.dayOnTime = webServer.arg("do").substring(0, 2).toInt() * 3600 + webServer.arg("do").substring(3, 5).toInt() * 60;
    // ------------------------------------------------------------------------
    webServer.arg("ii") == "0" ? settings.mySettings.itIs = false : settings.mySettings.itIs = true;
    // ------------------------------------------------------------------------
    if (webServer.arg("st").length())
    {
        Serial.println(webServer.arg("st"));
        handleTimeSetting(webServer.arg("st"));
    }
    // ------------------------------------------------------------------------
    settings.saveToEEPROM();
    callRoot();
    screenBufferNeedsUpdate = true;
}

// Page setEvent
void handleSetEvent()
{
    events[0].day = webServer.arg("day").toInt();
    events[0].month = webServer.arg("month").toInt();
    events[0].text = webServer.arg("text").substring(0, 40);
    events[0].color = (eColor)webServer.arg("color").toInt();
    ;
    webServer.send(200, "text/plain", "OK.");

#ifdef DEBUG
    Serial.println("Event set: " + String(events[0].day) + "." + String(events[0].month) + ". " + events[0].text);
#endif
}

// Page showText
void handleShowText()
{
#ifdef BUZZER
    uint8_t feedBuzzer = webServer.arg("buzzer").toInt();
#endif
    feedColor = webServer.arg("color").toInt();
    feedText = "  " + webServer.arg("text").substring(0, 80) + "   ";
    feedPosition = 0;
    webServer.send(200, "text/plain", "OK.");

#ifdef DEBUG
    Serial.println("Show text: " + webServer.arg("text").substring(0, 80));
#endif

#ifdef BUZZER
    for (uint8_t i = 0; i < feedBuzzer; i++)
    {
        digitalWrite(PIN_BUZZER, HIGH);
        delay(75);
        digitalWrite(PIN_BUZZER, LOW);
        delay(100);
    }
#endif

    setMode(MODE_FEED);
}

void handleControl()
{
    setMode((Mode)webServer.arg("mode").toInt());
    webServer.send(200, "text/plain", "OK.");
}

#endif
